In [1]:
import pandas as pd
import numpy as np

In [3]:
dictionary = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38]}
weatherDF = pd.DataFrame(dictionary)

In [4]:
weatherDF

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [5]:
weatherDF.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [6]:
newDictionary = {"Istanbul": [30,29,np.nan], "Ankara": [20,np.nan,25], "Izmir": [40,39,38], "Antalya":[45,np.nan,np.nan]}
newWeatherDF = pd.DataFrame(newDictionary)

In [7]:
newWeatherDF

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [9]:
newWeatherDF.dropna(axis=1,thresh=2)

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [10]:
newWeatherDF.fillna(0)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     0.0     39      0.0
2       0.0    25.0     38      0.0

## Group By

In [14]:
wageDict = {"Departmants": ["Software", "Software", "Marketing", "Marketing", "HR", "HR"],
              "Employee Name": ["A", "B", "C", "D", "E", "F"],
              "Wage": [100,150,200,300,400,500]}

In [15]:
wageDF = pd.DataFrame(wageDict)

In [16]:
wageDF

  Departmants Employee Name  Wage
0    Software             A   100
1    Software             B   150
2   Marketing             C   200
3   Marketing             D   300
4          HR             E   400
5          HR             F   500

In [17]:
groupObj = wageDF.groupby("Departmants")

In [18]:
groupObj.count()

             Employee Name  Wage
Departmants
HR                       2     2
Marketing                2     2
Software                 2     2

In [20]:
groupObj.mean("Wage")

              Wage
Departmants
HR           450.0
Marketing    250.0
Software     125.0

In [21]:
groupObj.describe()

             Wage
            count   mean        std    min    25%    50%    75%    max
Departmants
HR            2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Marketing     2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Software      2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0